In [1]:
import matplotlib.pyplot as plt
import pandas as pd
from datetime import datetime

In [2]:
import os
import configparser
from sqlalchemy import create_engine
import sqlalchemy.sql


mycfg = configparser.ConfigParser()
mycfg.read("/home/jovyan/Spring_23/3287/weatherundergroundData/mysql.cfg")
print(f"User    : [{mycfg['mysql']['user']}]")
database = mycfg['mysql']['url'].split('@')[1]  # leave off the password
print(f"Database: [[mysql://{mycfg['mysql']['user']}...@{database}]")

db_url = mycfg['mysql']['url'] 
os.environ['DATABASE_URL'] = db_url 
eng = create_engine(db_url)
con = eng.connect()

User    : [kaso6442]
Database: [[mysql://kaso6442...@www.db4free.net:3306/kaso6442_weather]

In [3]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.33',)]

## Getting to know the data and organization of data ##

In [4]:
%%sql
DROP TABLE IF EXISTS currentYear;
DROP TABLE IF EXISTS locations;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

In [5]:
%%sql
CREATE TABLE locations (
    ID VARCHAR(4) PRIMARY KEY,
    city VARCHAR(20) NOT NULL
);

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO locations VALUES('kclt', 'Charlotte, NC');
INSERT INTO locations VALUES('kcqt', 'Los Angeles, CA');
INSERT INTO locations VALUES('khou', 'Houston, TX');
INSERT INTO locations VALUES('kind', 'Indianapolis, IN');
INSERT INTO locations VALUES('kjax', 'Jacksonville, FL');
INSERT INTO locations VALUES('kmdw', 'Chicago, IL');
INSERT INTO locations VALUES('knyc', 'New York City, NY');
INSERT INTO locations VALUES('kphl', 'Philadelphia, PA');
INSERT INTO locations VALUES('kphx', 'Pheonix, AZ');
INSERT INTO locations VALUES('ksea', 'Seattle, WA');

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
SELECT * FROM locations;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
10 rows affected.

[('kclt', 'Charlotte, NC'),
 ('kcqt', 'Los Angeles, CA'),
 ('khou', 'Houston, TX'),
 ('kind', 'Indianapolis, IN'),
 ('kjax', 'Jacksonville, FL'),
 ('kmdw', 'Chicago, IL'),
 ('knyc', 'New York City, NY'),
 ('kphl', 'Philadelphia, PA'),
 ('kphx', 'Pheonix, AZ'),
 ('ksea', 'Seattle, WA')]

In [8]:
%%sql
SELECT * from kcqt
LIMIT 3;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
3 rows affected.

[(datetime.date(2014, 7, 1), 70, 63, 77, 63, 82, 52, 107, 1886, 1985, 0, 0, 0),
 (datetime.date(2014, 7, 2), 70, 62, 77, 63, 82, 51, 102, 1887, 1985, 0, 0, 0),
 (datetime.date(2014, 7, 3), 72, 63, 81, 63, 82, 52, 100, 1902, 1985, 0, 0, 0)]

In [ ]:
%%sql
SELECT DISTINCT TABLE_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME IN 
( SELECT TABLE_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE COLUMN_NAME = 'COL 8' )

## https://stackoverflow.com/questions/23752116/mysql-select-all-tables-with-multiple-specific-columns Dhwani's answer ##

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather

In [ ]:
for i in ['kclt', 'khou', 'kind', 'kjax', 'kmdw', 'knyc', 'kphl', 'kphx', 'ksea']:
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 2` TO actual_mean_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 3` TO actual_min_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 4` TO actual_max_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 5` TO average_min_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 6` TO average_max_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 7` TO record_min_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 8` TO record_max_temp"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 9` TO record_min_temp_year"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 10` TO record_max_temp_year"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 11` TO actual_precipitation"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 12` TO average_precipitation"""%i)
        con.execute("""ALTER TABLE %s RENAME COLUMN `COL 13` TO record_precipitation"""%i)

In [ ]:
for i in ['kclt', 'khou', 'kind', 'kjax', 'kmdw', 'knyc', 'kphl', 'kphx', 'ksea']:
    con.execute("""DELETE FROM %s LIMIT 1"""%i)

In [ ]:
con.execute("""DELETE FROM kcqt LIMIT 1""")

In [4]:
%%sql
## for negative numbers ##
SELECT DISTINCT record_min_temp from knyc
WHERE record_min_temp < 0
ORDER BY ABS(record_min_temp) DESC
LIMIT 6;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
6 rows affected.

[('-15',), ('-13',), ('-8',), ('-7',), ('-6',), ('-5',)]

In [5]:
%%sql
SELECT * FROM kcqt
LIMIT 3;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
3 rows affected.

[(datetime.date(2014, 7, 1), 70, 63, 77, 63, 82, 52, 107, 1886, 1985, 0, 0, 0),
 (datetime.date(2014, 7, 2), 70, 62, 77, 63, 82, 51, 102, 1887, 1985, 0, 0, 0),
 (datetime.date(2014, 7, 3), 72, 63, 81, 63, 82, 52, 100, 1902, 1985, 0, 0, 0)]

In [6]:
%%sql
SELECT DISTINCT record_max_temp, record_max_temp_year
FROM kcqt
ORDER BY record_max_temp DESC 
LIMIT 5;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[(113, 2010), (112, 1990), (110, 1955), (110, 1988), (109, 1891)]

In [7]:
%%sql
describe kcqt

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
13 rows affected.

[('date', 'date', 'YES', '', None, ''),
 ('actual_mean_temp', 'int', 'YES', '', None, ''),
 ('actual_min_temp', 'int', 'YES', '', None, ''),
 ('actual_max_temp', 'int', 'YES', '', None, ''),
 ('average_min_temp', 'int', 'YES', '', None, ''),
 ('average_max_temp', 'int', 'YES', '', None, ''),
 ('record_min_temp', 'int', 'YES', '', None, ''),
 ('record_max_temp', 'int', 'YES', '', None, ''),
 ('record_min_temp_year', 'int', 'YES', '', None, ''),
 ('record_max_temp_year', 'int', 'YES', '', None, ''),
 ('actual_precipitation', 'int', 'YES', '', None, ''),
 ('average_precipitation', 'int', 'YES', '', None, ''),
 ('record_precipitation', 'int', 'YES', '', None, '')]

In [ ]:
for i in ['kcqt', 'kclt', 'khou', 'kind', 'kjax', 'kmdw', 'knyc', 'kphl', 'kphx', 'ksea']:
    con.execute("""ALTER TABLE %s MODIFY date DATE"""%i)
    con.execute("""ALTER TABLE %s MODIFY actual_min_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY actual_max_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY average_min_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY average_max_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_min_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_max_temp INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_min_temp_year INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_max_temp_year INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY actual_precipitation INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY average_precipitation INTEGER"""%i)
    con.execute("""ALTER TABLE %s MODIFY record_precipitation INTEGER"""%i)

## Creating new tables from imported data ##

The following table, currentYear, holds the (hypothetical) current weather information for 2023 from these various locations across the country:
* New York, New York
* Jacksonville, Florida
* Seattle, Washingtom
* Pheonix, Arizona
* Chicago, Illinois

It keeps track of the current records and averages and updates them when necessary.
An entry into this table would be today_min_temp and today_max_temp while the rest are updated automatically by an implemented trigger.

In [8]:
%%sql

DROP TABLE IF EXISTS currentYear;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.

[]

In [9]:
%%sql
CREATE TABLE currentYear (
    today_date DATE DEFAULT (DATE_FORMAT(CURDATE()-1, '%Y-%m-%d')),
    station VARCHAR (4) PRIMARY KEY,
    location VARCHAR(50),
    today_min_temp INT,
    today_min_avg INT,
    today_max_temp INT,
    today_max_avg INT,
    average_min_temp INT,
    average_max_temp INT,
    record_min_temp INT,
    record_min_temp_date VARCHAR(10),
    record_max_temp INT,
    record_max_temp_date VARCHAR(10),
    CONSTRAINT station_fk FOREIGN KEY (station) REFERENCES locations (ID) on delete cascade
);

# add triggers to create rows for average and records along with years as data is being added into the currentYear.

# example: if current actual min < record min for that day, update record min for that station on that day to current temp and year
# and enter that data into current table.
# else, bring over data from station table to current table.

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

In [10]:
%%sql
# originally sets today's date and adds in the location and station information #
INSERT INTO currentYear (station, location)
SELECT ID, city
FROM locations
WHERE locations.ID = 'knyc' or locations.ID = 'kjax' or locations.ID = 'kphx' or locations.ID = 'ksea' or locations.ID = 'kmdw'

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[]

In [11]:
%sql SELECT * FROM currentYear

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[(datetime.date(2023, 5, 4), 'kjax', 'Jacksonville, FL', None, None, None, None, None, None, None, None, None, None),
 (datetime.date(2023, 5, 4), 'kmdw', 'Chicago, IL', None, None, None, None, None, None, None, None, None, None),
 (datetime.date(2023, 5, 4), 'knyc', 'New York City, NY', None, None, None, None, None, None, None, None, None, None),
 (datetime.date(2023, 5, 4), 'kphx', 'Pheonix, AZ', None, None, None, None, None, None, None, None, None, None),
 (datetime.date(2023, 5, 4), 'ksea', 'Seattle, WA', None, None, None, None, None, None, None, None, None, None)]

### Insert stats from existing data

In [12]:
%%sql
## adding record min temp and date to table currentYear ##
UPDATE currentYear SET record_min_temp = 
    (SELECT DISTINCT record_min_temp from knyc
    WHERE record_min_temp < 0
    ORDER BY ABS(record_min_temp) DESC
    LIMIT 1),
    record_min_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_min_temp_year) FROM knyc
    WHERE record_min_temp = (SELECT MIN(record_min_temp)FROM knyc)ORDER BY record_min_temp_year DESC LIMIT 1) 
    WHERE station = 'knyc';

UPDATE currentYear SET record_min_temp = (SELECT MIN(record_min_temp)FROM kjax),
    record_min_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_min_temp_year) FROM kjax
    WHERE record_min_temp = (SELECT MIN(record_min_temp)FROM kjax)ORDER BY record_min_temp_year DESC LIMIT 1) 
    WHERE station = 'kjax';
    
UPDATE currentYear SET record_min_temp = (SELECT MIN(record_min_temp)FROM kphx),
    record_min_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_min_temp_year) FROM kphx
    WHERE record_min_temp = (SELECT MIN(record_min_temp)FROM kphx)ORDER BY record_min_temp_year DESC LIMIT 1) 
    WHERE station = 'kphx';

UPDATE currentYear SET record_min_temp = (SELECT MIN(record_min_temp)FROM ksea),
    record_min_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_min_temp_year) FROM ksea
    WHERE record_min_temp = (SELECT MIN(record_min_temp)FROM ksea)ORDER BY record_min_temp_year DESC LIMIT 1) 
    WHERE station = 'ksea';
    
UPDATE currentYear SET record_min_temp = 
    (SELECT DISTINCT record_min_temp from kmdw
    WHERE record_min_temp < 0
    ORDER BY ABS(record_min_temp) DESC
    LIMIT 1),
    record_min_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_min_temp_year) FROM kmdw
    WHERE record_min_temp = (SELECT MIN(record_min_temp)FROM kmdw)ORDER BY record_min_temp_year DESC LIMIT 1) 
    WHERE station = 'kmdw';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [13]:
%%sql
## adding record max temp and date to table currentYear ##
UPDATE currentYear SET record_max_temp = (SELECT DISTINCT record_max_temp FROM knyc ORDER BY ABS(record_max_temp) DESC LIMIT 1),
    record_max_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_max_temp_year) FROM knyc
    WHERE record_max_temp = (SELECT MAX(record_max_temp)FROM knyc)ORDER BY record_max_temp_year DESC LIMIT 1) 
    WHERE station = 'knyc';

UPDATE currentYear SET record_max_temp = (SELECT DISTINCT record_max_temp FROM kjax ORDER BY ABS(record_max_temp) DESC LIMIT 1),
    record_max_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_max_temp_year) FROM kjax
    WHERE record_max_temp = (SELECT MAX(record_max_temp)FROM kjax)ORDER BY record_max_temp_year DESC LIMIT 1) 
    WHERE station = 'kjax';
    
UPDATE currentYear SET record_max_temp = (SELECT DISTINCT record_max_temp FROM kphx ORDER BY ABS(record_max_temp) DESC LIMIT 1),
    record_max_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_max_temp_year) FROM kphx
    WHERE record_max_temp = (SELECT MAX(record_max_temp)FROM kphx)ORDER BY record_max_temp_year DESC LIMIT 1) 
    WHERE station = 'kphx';

UPDATE currentYear SET record_max_temp = (SELECT DISTINCT record_max_temp FROM ksea ORDER BY ABS(record_max_temp) DESC LIMIT 1),
    record_max_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_max_temp_year) FROM ksea
    WHERE record_max_temp = (SELECT MAX(record_max_temp)FROM ksea)ORDER BY record_max_temp_year DESC LIMIT 1) 
    WHERE station = 'ksea';
    
UPDATE currentYear SET record_max_temp = (SELECT DISTINCT record_max_temp FROM kmdw ORDER BY ABS(record_max_temp) DESC LIMIT 1),
    record_max_temp_date= (SELECT CONCAT(MONTH(date), '/', DAY(date), '/',record_max_temp_year) FROM kmdw
    WHERE record_max_temp = (SELECT MAX(record_max_temp)FROM kmdw)ORDER BY record_max_temp_year DESC LIMIT 1) 
    WHERE station = 'kmdw';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql
SELECT date, average_min_temp
FROM knyc
WHERE MONTH(date) = MONTH(CURDATE()) and DAY(date) = DAY(CURDATE())-1

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[(datetime.date(2015, 5, 4), '50')]

In [15]:
%%sql

WITH
    minAvg AS (
        SELECT AVG(average_min_temp)
        FROM knyc
        WHERE MONTH(date) = MONTH(CURDATE()) and DAY(date) = DAY(CURDATE())
    ), 
    
    maxAvg AS (
        SELECT AVG(average_max_temp)
        FROM knyc
        WHERE MONTH(date) = MONTH(CURDATE()) and DAY(date) = DAY(CURDATE())
    )
SELECT * FROM minAvg, maxAvg

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[(51.0, 68.0)]

In [16]:
%%sql

SELECT AVG(average_min_temp), AVG(average_max_temp)
FROM kjax

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[(Decimal('57.8877'), Decimal('79.3918'))]

In [15]:

## adding today's average max temp and today's average min temp to table currentYear ##
# Need to use the current day's averages #
for i in ['kjax', 'kmdw', 'knyc', 'kphx', 'ksea']:
    con.execute("""SET @station := '%s'"""%i)
    con.execute("""UPDATE currentYear SET today_min_avg = (SELECT average_min_temp
        FROM %s WHERE MONTH(date) = MONTH(CURDATE()) and DAY(date) = DAY(CURDATE())-1) WHERE station = @station"""%i)
    con.execute("""UPDATE currentYear SET today_max_avg = (SELECT average_max_temp
        FROM %s WHERE MONTH(date) = MONTH(CURDATE()) and DAY(date) = DAY(CURDATE())-1) WHERE station = @station"""%i)

In [16]:
# adding average data for all year at each location #
# Need to use average of averages to show whole year avg #
for i in ['kjax', 'kmdw', 'knyc', 'kphx', 'ksea']:
    con.execute("""SET @station := '%s'"""%i)
    con.execute("""UPDATE currentYear SET average_min_temp = (SELECT AVG(average_min_temp)
        FROM %s) WHERE station = @station"""%i)
    con.execute("""UPDATE currentYear SET average_max_temp = (SELECT AVG(average_max_temp)
        FROM %s) WHERE station = @station"""%i)

In [17]:
%%sql
DROP TABLE if exists currentLog;

CREATE TABLE currentLog(
    date DATE,
    station VARCHAR(4),
    actual_min INT,
    actual_max INT,
    average_min INT, ##avg for today's date
    average_max INT, ##avg for today's date
    record_min INT,
    record_max INT,
    record_min_date VARCHAR(10),
    record_max_date VARCHAR(10),
    avg_min_so_far INT, ##a running average for 1/1/23 -> current date.
    avg_max_so_far INT, ##a running average for 1/1/23 -> current date.
    status VARCHAR(8), ##active or inactive. Inactive if station is removed from currentYear data collection.
    CONSTRAINT sd_unique UNIQUE (station, date) #data per date can only occur once per station.
);

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

### Create Indexes

In [ ]:
for i in ['kjax', 'kmdw', 'knyc', 'kphx', 'ksea']:
	check=con.execute("""SHOW INDEX FROM %s WHERE KEY_NAME = 'date'"""%i).fetchall()
	if not check :
		con.execute("""create index date on %s(date)"""%i)
		print('Index on %s added'%i)
	else:
		print('index already on %s'%i)

In [21]:
%%sql
SELECT table_name, index_name, column_name
FROM information_schema.statistics
WHERE table_schema = "kaso6442_weather";

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
9 rows affected.

[('currentLog', 'sd_unique', 'date'),
 ('currentLog', 'sd_unique', 'station'),
 ('currentYear', 'PRIMARY', 'station'),
 ('kjax', 'date', 'date'),
 ('kmdw', 'date', 'date'),
 ('knyc', 'date', 'date'),
 ('kphx', 'date', 'date'),
 ('ksea', 'date', 'date'),
 ('locations', 'PRIMARY', 'ID')]

### Create Triggers

In [18]:
%%sql
drop trigger if exists updateOnCurrentYear;
drop trigger if exists updateCurrentLog;
drop trigger if exists updateCurrentLogAvg;
drop trigger if exists deleteFromCurrentYear;
drop trigger if exists deleteFromStationTable;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [50]:
%%sql
#update the daily average of the new addition and any records and record years that are broken.
#assuming that the number of data points used starts in 1900 there are 2015-1900 years worth of data (115)
#change the date when a new temp is updated

drop trigger if exists updateOnCurrentYear;

create trigger updateOnCurrentYear
    before update on currentYear
for each row
begin
    
    
    if (SELECT new.today_min_temp != old.today_min_temp) THEN
        set new.today_min_avg = ((old.today_min_avg*115)+ new.today_min_temp)/116;
    end if;
    
    if (SELECT new.today_max_temp != old.today_max_temp) THEN
        set new.today_max_avg = ((old.today_max_avg*115)+ new.today_max_temp)/116;
    end if;
    
    if (SELECT new.today_min_temp < old.record_min_temp) THEN
        set new.record_min_temp = new.today_min_temp;
    end if;
    
    if (SELECT new.today_min_temp < old.record_min_temp) THEN
        set new.record_min_temp_date = YEAR(new.today_date);
    end if;
    
    if (SELECT new.today_max_temp < old.record_max_temp) THEN
        set new.record_max_temp = new.today_max_temp;
    end if;
    
    if (SELECT new.today_max_temp < old.record_max_temp) THEN
        set new.record_max_temp_date = YEAR(new.today_date);
    end if;   
end;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

In [21]:
%%sql
#after update on currentYear, add a row to currentLog

drop trigger if exists updateCurrentLog;

create trigger updateCurrentLog
    after update on currentYear
for each row
begin
    INSERT INTO currentLog (date, station, actual_min, actual_max, average_min, average_max, record_min, record_max, 
                            record_min_date, record_max_date, avg_min_so_far, avg_max_so_far, status)
    VALUES (new.today_date, new.station, new.today_min_temp, new.today_max_temp, new.today_min_avg, new.today_max_avg, new.record_min_temp,
           new.record_max_temp, SUBSTRING(new.record_min_temp_date, -4), SUBSTRING(new.record_max_temp_date, -4), 0, 0, 'ACTIVE');
end;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

In [22]:
%%sql
#after update on currentYear, the new row inserted in currentLog needs the avg_min/max_so_far column calculated

drop trigger if exists updateCurrentLogAvg;

create trigger updateCurrentLogAvg
    before insert on currentLog for each row
begin
DECLARE avgMin INT;
DECLARE avgMax INT;
DECLARE countMinMax INT;
DECLARE countMax INT;
    begin
        set avgMin := (SELECT SUM(actual_min) FROM currentLog WHERE station = new.station);
        set countMinMax := (SELECT COUNT(*) FROM currentLog WHERE station = new.station);
        set avgMax := (SELECT SUM(actual_max) FROM currentLog WHERE station = new.station);
        
        set new.avg_min_so_far = avgMin/countMinMax, new.avg_max_so_far = avgMax/countMinMax;
    end;
end;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

In [23]:
%%sql
#if a row is deleted from current_year, it needs to be reflected in the currentLog as the end of data collection for that station.

drop trigger if exists deleteFromCurrentYear;

create trigger deleteFromCurrentYear
    before delete on currentYear
for each row
begin
   INSERT INTO currentLog (date, station, status)
    VALUES (CURDATE(), old.station, 'INACTIVE');
end;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

In [24]:
%%sql
drop trigger if exists deleteFromStationTable;

create trigger deleteFromStationTable
    before delete on locations
for each row
begin
    DELETE 
    FROM currentYear
    WHERE station = old.ID;
end;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
0 rows affected.
0 rows affected.

[]

### Using Indexes and Triggers to build tables holding different information

In [27]:
%%sql

SELECT actual_min_temp, average_min_temp, actual_max_temp, average_max_temp
FROM knyc 
WHERE date = '2015-01-01'

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[('27', '28', '39', '39')]

In [25]:
%%sql
SELECT * FROM currentYear

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[(datetime.date(2023, 5, 4), 'kjax', 'Jacksonville, FL', None, 59, None, 83, 58, 79, 7, '1/21/1985', 104, '7/11/1879'),
 (datetime.date(2023, 5, 4), 'kmdw', 'Chicago, IL', None, 48, None, 66, 44, 59, -25, '1/20/1985', 109, '7/23/1934'),
 (datetime.date(2023, 5, 4), 'knyc', 'New York City, NY', None, 50, None, 68, 48, 62, -15, '12/25/1980', 106, '8/13/2005'),
 (datetime.date(2023, 5, 4), 'kphx', 'Pheonix, AZ', None, 66, None, 91, 64, 87, 16, '1/7/1913', 122, '3/16/2007'),
 (datetime.date(2023, 5, 4), 'ksea', 'Seattle, WA', None, 45, None, 62, 45, 60, 0, '1/31/1950', 103, '7/23/1991')]

In [26]:
%%sql

SELECT today_date as 'today', location, today_max_temp as 'todays high', today_max_avg as 'avg high for this day', 
    average_max_temp as 'yearly high temp avg', record_max_temp as 'all time high', record_max_temp_date as 'date of record high'
FROM currentYear

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[(datetime.date(2023, 5, 4), 'Jacksonville, FL', None, 83, 79, 104, '7/11/1879'),
 (datetime.date(2023, 5, 4), 'Chicago, IL', None, 66, 59, 109, '7/23/1934'),
 (datetime.date(2023, 5, 4), 'New York City, NY', None, 68, 62, 106, '8/13/2005'),
 (datetime.date(2023, 5, 4), 'Pheonix, AZ', None, 91, 87, 122, '3/16/2007'),
 (datetime.date(2023, 5, 4), 'Seattle, WA', None, 62, 60, 103, '7/23/1991')]

In [27]:
%%sql

UPDATE currentYear
SET today_max_temp = 80, today_min_temp = 62
WHERE station = 'kjax';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[]

In [28]:
%%sql
SELECT * FROM currentYear

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[(datetime.date(2023, 5, 4), 'kjax', 'Jacksonville, FL', 62, 59, 80, 83, 58, 79, 7, '1/21/1985', 104, '7/11/1879'),
 (datetime.date(2023, 5, 4), 'kmdw', 'Chicago, IL', None, 48, None, 66, 44, 59, -25, '1/20/1985', 109, '7/23/1934'),
 (datetime.date(2023, 5, 4), 'knyc', 'New York City, NY', None, 50, None, 68, 48, 62, -15, '12/25/1980', 106, '8/13/2005'),
 (datetime.date(2023, 5, 4), 'kphx', 'Pheonix, AZ', None, 66, None, 91, 64, 87, 16, '1/7/1913', 122, '3/16/2007'),
 (datetime.date(2023, 5, 4), 'ksea', 'Seattle, WA', None, 45, None, 62, 45, 60, 0, '1/31/1950', 103, '7/23/1991')]

In [29]:
%%sql
SELECT * FROM currentLog

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
16 rows affected.

[(datetime.date(2023, 5, 1), 'kphx', 72, 95, 65, 90, 42, 103, '1915', '1985', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'knyc', 50, 63, 50, 67, 35, 87, '1880', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'ksea', 48, 56, 44, 62, 28, 85, '1954', '2014', 44, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kmdw', 41, 50, 47, 65, 30, 90, '1943', '1951', 47, 65, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kjax', 53, 85, 58, 82, 47, 96, '2000', '1990', 58, 82, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kphx', 66, 92, 65, 90, 40, 107, '1967', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'knyc', 45, 57, 50, 67, 37, 90, '1903', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'ksea', 51, 71, 45, 62, 33, 74, '1952', '1966', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kmdw', 43, 55, 47, 66, 30, 91, '1978', '1959', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kjax', 59, 84, 59, 83, 47, 95, '1941', '1990', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kphx', 68, 89, 66, 91, 39, 109, '1899', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'knyc', 48, 57, 50, 67, 36, 90, '1874', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'ksea', 51, 72, 45, 62, 35, 77, '1950', '1992', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kmdw', 41, 57, 48, 66, 32, 92, '1971', '1955', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kjax', 55, 82, 59, 83, 47, 94, '1981', '2002', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 4), 'kjax', 62, 80, 59, 83, 7, 104, '1985', '1879', 56, 84, 'ACTIVE')]

In [19]:
%%sql

INSERT INTO currentLog VALUES('2023-05-01', 'kphx', 72, 95, 65, 90, 42, 103, '1915', '1985', 65, 90, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-01', 'knyc', 50, 63, 50, 67, 35, 87, '1880', '2001', 50, 67, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-01', 'ksea', 48, 56, 44, 62, 28, 85, '1954', '2014', 44, 62, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-01', 'kmdw', 41, 50, 47, 65, 30, 90, '1943', '1951', 47, 65, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-01', 'kjax', 53, 85, 58, 82, 47, 96, '2000', '1990', 58, 82, 'ACTIVE');

INSERT INTO currentLog VALUES('2023-05-02', 'kphx', 66, 92, 65, 90, 40, 107, '1967', '1947', 65, 90, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-02', 'knyc', 45, 57, 50, 67, 37, 90, '1903', '2001', 50, 67, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-02', 'ksea', 51, 71, 45, 62, 33, 74, '1952', '1966', 45, 62, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-02', 'kmdw', 43, 55, 47, 66, 30, 91, '1978', '1959', 47, 66, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-02', 'kjax', 59, 84, 59, 83, 47, 95, '1941', '1990', 59, 83, 'ACTIVE');

INSERT INTO currentLog VALUES('2023-05-03', 'kphx', 68, 89, 66, 91, 39, 109, '1899', '1947', 65, 90, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-03', 'knyc', 48, 57, 50, 67, 36, 90, '1874', '2001', 50, 67, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-03', 'ksea', 51, 72, 45, 62, 35, 77, '1950', '1992', 45, 62, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-03', 'kmdw', 41, 57, 48, 66, 32, 92, '1971', '1955', 47, 66, 'ACTIVE');
INSERT INTO currentLog VALUES('2023-05-03', 'kjax', 55, 82, 59, 83, 47, 94, '1981', '2002', 59, 83, 'ACTIVE');

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

# Demonstrating How Everything Works

In [30]:
%%sql
## all tables in the database
SHOW TABLES;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
13 rows affected.

[('currentLog',),
 ('currentYear',),
 ('kclt',),
 ('kcqt',),
 ('khou',),
 ('kind',),
 ('kjax',),
 ('kmdw',),
 ('knyc',),
 ('kphl',),
 ('kphx',),
 ('ksea',),
 ('locations',)]

In [37]:
%%sql
## all indexes created and auto-generated

SELECT table_name, index_name, column_name
FROM information_schema.statistics
WHERE table_schema = "kaso6442_weather";

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
9 rows affected.

[('currentLog', 'sd_unique', 'date'),
 ('currentLog', 'sd_unique', 'station'),
 ('currentYear', 'PRIMARY', 'station'),
 ('kjax', 'date', 'date'),
 ('kmdw', 'date', 'date'),
 ('knyc', 'date', 'date'),
 ('kphx', 'date', 'date'),
 ('ksea', 'date', 'date'),
 ('locations', 'PRIMARY', 'ID')]

In [38]:
%%sql 
## list of triggers and a little about what they do

SELECT trigger_name, event_manipulation, event_object_table, action_timing
FROM information_schema.triggers;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[('updateOnCurrentYear', 'UPDATE', 'currentYear', 'BEFORE'),
 ('updateCurrentLog', 'UPDATE', 'currentYear', 'AFTER'),
 ('deleteFromCurrentYear', 'DELETE', 'currentYear', 'BEFORE'),
 ('deleteFromStationTable', 'DELETE', 'locations', 'BEFORE'),
 ('updateCurrentLogAvg', 'INSERT', 'currentLog', 'BEFORE')]

In [39]:
%%sql
## foreign key references

SELECT TABLE_NAME, COLUMN_NAME, CONSTRAINT_NAME, REFERENCED_TABLE_NAME, REFERENCED_COLUMN_NAME 
FROM INFORMATION_SCHEMA.KEY_COLUMN_USAGE
WHERE REFERENCED_TABLE_SCHEMA = 'kaso6442_weather';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[('currentYear', 'station', 'station_fk', 'locations', 'ID')]

### Updating information and showing triggers in use

In [31]:
%%sql
## Someone using this data collection tool would see this from the day before. (None values would be filled in)
## They would then update the today_min/max_temp fields and everything calculates for them and the date is updated along with the Log table.
SELECT * FROM currentYear;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[(datetime.date(2023, 5, 4), 'kjax', 'Jacksonville, FL', 62, 59, 80, 83, 58, 79, 7, '1/21/1985', 104, '7/11/1879'),
 (datetime.date(2023, 5, 4), 'kmdw', 'Chicago, IL', None, 48, None, 66, 44, 59, -25, '1/20/1985', 109, '7/23/1934'),
 (datetime.date(2023, 5, 4), 'knyc', 'New York City, NY', None, 50, None, 68, 48, 62, -15, '12/25/1980', 106, '8/13/2005'),
 (datetime.date(2023, 5, 4), 'kphx', 'Pheonix, AZ', None, 66, None, 91, 64, 87, 16, '1/7/1913', 122, '3/16/2007'),
 (datetime.date(2023, 5, 4), 'ksea', 'Seattle, WA', None, 45, None, 62, 45, 60, 0, '1/31/1950', 103, '7/23/1991')]

In [32]:
%%sql
SELECT * FROM currentLog
ORDER BY date DESC;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
16 rows affected.

[(datetime.date(2023, 5, 4), 'kjax', 62, 80, 59, 83, 7, 104, '1985', '1879', 56, 84, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kphx', 68, 89, 66, 91, 39, 109, '1899', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'knyc', 48, 57, 50, 67, 36, 90, '1874', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'ksea', 51, 72, 45, 62, 35, 77, '1950', '1992', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kmdw', 41, 57, 48, 66, 32, 92, '1971', '1955', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kjax', 55, 82, 59, 83, 47, 94, '1981', '2002', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kphx', 66, 92, 65, 90, 40, 107, '1967', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'knyc', 45, 57, 50, 67, 37, 90, '1903', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'ksea', 51, 71, 45, 62, 33, 74, '1952', '1966', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kmdw', 43, 55, 47, 66, 30, 91, '1978', '1959', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kjax', 59, 84, 59, 83, 47, 95, '1941', '1990', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kphx', 72, 95, 65, 90, 42, 103, '1915', '1985', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'knyc', 50, 63, 50, 67, 35, 87, '1880', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'ksea', 48, 56, 44, 62, 28, 85, '1954', '2014', 44, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kmdw', 41, 50, 47, 65, 30, 90, '1943', '1951', 47, 65, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kjax', 53, 85, 58, 82, 47, 96, '2000', '1990', 58, 82, 'ACTIVE')]

In [33]:
%%sql
## when updating a today_min_temp and a today_max_temp we see the changes in the currentYear and currentLog tables.

UPDATE currentYear
SET today_max_temp = 56, today_min_temp = 47
WHERE station = 'ksea';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[]

In [34]:
%%sql
SELECT * FROM currentYear;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
5 rows affected.

[(datetime.date(2023, 5, 4), 'kjax', 'Jacksonville, FL', 62, 59, 80, 83, 58, 79, 7, '1/21/1985', 104, '7/11/1879'),
 (datetime.date(2023, 5, 4), 'kmdw', 'Chicago, IL', None, 48, None, 66, 44, 59, -25, '1/20/1985', 109, '7/23/1934'),
 (datetime.date(2023, 5, 4), 'knyc', 'New York City, NY', None, 50, None, 68, 48, 62, -15, '12/25/1980', 106, '8/13/2005'),
 (datetime.date(2023, 5, 4), 'kphx', 'Pheonix, AZ', None, 66, None, 91, 64, 87, 16, '1/7/1913', 122, '3/16/2007'),
 (datetime.date(2023, 5, 4), 'ksea', 'Seattle, WA', 47, 45, 56, 62, 45, 60, 0, '1/31/1950', 103, '7/23/1991')]

In [35]:
%%sql
SELECT * FROM currentLog
WHERE station = 'ksea';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
4 rows affected.

[(datetime.date(2023, 5, 1), 'ksea', 48, 56, 44, 62, 28, 85, '1954', '2014', 44, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'ksea', 51, 71, 45, 62, 33, 74, '1952', '1966', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'ksea', 51, 72, 45, 62, 35, 77, '1950', '1992', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 4), 'ksea', 47, 56, 45, 62, 0, 103, '1950', '1991', 50, 66, 'ACTIVE')]

In [36]:
%%sql
SELECT * FROM currentLog
ORDER BY date DESC;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
17 rows affected.

[(datetime.date(2023, 5, 4), 'ksea', 47, 56, 45, 62, 0, 103, '1950', '1991', 50, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 4), 'kjax', 62, 80, 59, 83, 7, 104, '1985', '1879', 56, 84, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kjax', 55, 82, 59, 83, 47, 94, '1981', '2002', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kmdw', 41, 57, 48, 66, 32, 92, '1971', '1955', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'ksea', 51, 72, 45, 62, 35, 77, '1950', '1992', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'knyc', 48, 57, 50, 67, 36, 90, '1874', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kphx', 68, 89, 66, 91, 39, 109, '1899', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kmdw', 43, 55, 47, 66, 30, 91, '1978', '1959', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kjax', 59, 84, 59, 83, 47, 95, '1941', '1990', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'ksea', 51, 71, 45, 62, 33, 74, '1952', '1966', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'knyc', 45, 57, 50, 67, 37, 90, '1903', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kphx', 66, 92, 65, 90, 40, 107, '1967', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kphx', 72, 95, 65, 90, 42, 103, '1915', '1985', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kjax', 53, 85, 58, 82, 47, 96, '2000', '1990', 58, 82, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kmdw', 41, 50, 47, 65, 30, 90, '1943', '1951', 47, 65, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'ksea', 48, 56, 44, 62, 28, 85, '1954', '2014', 44, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'knyc', 50, 63, 50, 67, 35, 87, '1880', '2001', 50, 67, 'ACTIVE')]

In [41]:
%%sql
SELECT record_max_temp, record_max_temp_year, record_min_temp, record_min_temp_year
FROM knyc
WHERE date = '2015-05-04'

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[('92', '2001', '38', '1917')]

In [54]:
%%sql
#showing trigger fire if the min or max temp replaces the old one
## yikes, crazy weather day!

UPDATE currentYear
SET today_max_temp = 93, today_min_temp = -16
WHERE station = 'knyc';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[]

In [55]:
%%sql
SELECT * FROM currentLog
WHERE station = 'knyc';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
4 rows affected.

[(datetime.date(2023, 5, 1), 'knyc', 50, 63, 50, 67, 35, 87, '1880', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'knyc', 45, 57, 50, 67, 37, 90, '1903', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'knyc', 48, 57, 50, 67, 36, 90, '1874', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 4), 'knyc', -16, 93, 49, 68, -16, 93, '2023', '2023', 48, 59, 'ACTIVE')]

### Deleting information and showing triggers in use

In [37]:
%%sql
DELETE FROM locations
WHERE ID = 'ksea';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
1 rows affected.

[]

In [38]:
%%sql
SELECT * FROM locations

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
9 rows affected.

[('kclt', 'Charlotte, NC'),
 ('kcqt', 'Los Angeles, CA'),
 ('khou', 'Houston, TX'),
 ('kind', 'Indianapolis, IN'),
 ('kjax', 'Jacksonville, FL'),
 ('kmdw', 'Chicago, IL'),
 ('knyc', 'New York City, NY'),
 ('kphl', 'Philadelphia, PA'),
 ('kphx', 'Pheonix, AZ')]

In [39]:
%sql SELECT * FROM currentYear

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
4 rows affected.

[(datetime.date(2023, 5, 4), 'kjax', 'Jacksonville, FL', 62, 59, 80, 83, 58, 79, 7, '1/21/1985', 104, '7/11/1879'),
 (datetime.date(2023, 5, 4), 'kmdw', 'Chicago, IL', None, 48, None, 66, 44, 59, -25, '1/20/1985', 109, '7/23/1934'),
 (datetime.date(2023, 5, 4), 'knyc', 'New York City, NY', None, 50, None, 68, 48, 62, -15, '12/25/1980', 106, '8/13/2005'),
 (datetime.date(2023, 5, 4), 'kphx', 'Pheonix, AZ', None, 66, None, 91, 64, 87, 16, '1/7/1913', 122, '3/16/2007')]

In [40]:
%%sql 
SELECT * FROM currentLog
ORDER BY date DESC;

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
18 rows affected.

[(datetime.date(2023, 5, 5), 'ksea', None, None, None, None, None, None, None, None, 49, 64, 'INACTIVE'),
 (datetime.date(2023, 5, 4), 'ksea', 47, 56, 45, 62, 0, 103, '1950', '1991', 50, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 4), 'kjax', 62, 80, 59, 83, 7, 104, '1985', '1879', 56, 84, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kjax', 55, 82, 59, 83, 47, 94, '1981', '2002', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kmdw', 41, 57, 48, 66, 32, 92, '1971', '1955', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'ksea', 51, 72, 45, 62, 35, 77, '1950', '1992', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'knyc', 48, 57, 50, 67, 36, 90, '1874', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 3), 'kphx', 68, 89, 66, 91, 39, 109, '1899', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kjax', 59, 84, 59, 83, 47, 95, '1941', '1990', 59, 83, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kmdw', 43, 55, 47, 66, 30, 91, '1978', '1959', 47, 66, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'ksea', 51, 71, 45, 62, 33, 74, '1952', '1966', 45, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'knyc', 45, 57, 50, 67, 37, 90, '1903', '2001', 50, 67, 'ACTIVE'),
 (datetime.date(2023, 5, 2), 'kphx', 66, 92, 65, 90, 40, 107, '1967', '1947', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kphx', 72, 95, 65, 90, 42, 103, '1915', '1985', 65, 90, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kjax', 53, 85, 58, 82, 47, 96, '2000', '1990', 58, 82, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'kmdw', 41, 50, 47, 65, 30, 90, '1943', '1951', 47, 65, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'ksea', 48, 56, 44, 62, 28, 85, '1954', '2014', 44, 62, 'ACTIVE'),
 (datetime.date(2023, 5, 1), 'knyc', 50, 63, 50, 67, 35, 87, '1880', '2001', 50, 67, 'ACTIVE')]

# Queries to look at data in different ways

In [70]:
%%sql
## This query compares the average temperatures from each location to the actual mean temps from that day in 2015

WITH
    avg2023 AS (
        SELECT MONTH(date) as 'Month', DAY(date) as 'Day', average_min, average_max
        FROM currentLog
    ),
    mean2015 AS (
        SELECT MONTH(kjax.date) as 'Month', DAY(kjax.date) as 'Day', kjax.actual_mean_temp as 'kjaxMean', ksea.actual_mean_temp as 'kseaMean', 
                kphx.actual_mean_temp as 'kphxMean', kmdw.actual_mean_temp as 'kmdwMean', knyc.actual_mean_temp as 'knycMean'
        FROM kjax
            JOIN ksea
                ON kjax.date = ksea.date
            JOIN kphx
                ON kjax.date = kphx.date
            JOIN kmdw
                ON kjax.date = kmdw.date
            JOIN knyc
                ON kjax.date = knyc.date
    )
SELECT avg2023.Month as 'Month', avg2023.Day as 'Day', avg2023.average_min as '2023 Min', avg2023.average_max as '2023 Max', mean2015.kjaxMean as 'kjaxMean',
        mean2015.kseaMean as 'kseaMean', mean2015.kphxMean as 'kphxMean', mean2015.kmdwMean as 'kmdwMean', mean2015.knycMean as 'knycMean'
FROM avg2023, mean2015
WHERE avg2023.Month = mean2015.Month and avg2023.Day = mean2015.Day and avg2023.Day != '05';

 * mysql://kaso6442:***@www.db4free.net:3306/kaso6442_weather
18 rows affected.

[(5, 1, 58, 82, 66, '57', '86', 53, '56'),
 (5, 1, 47, 65, 66, '57', '86', 53, '56'),
 (5, 1, 44, 62, 66, '57', '86', 53, '56'),
 (5, 1, 50, 67, 66, '57', '86', 53, '56'),
 (5, 1, 65, 90, 66, '57', '86', 53, '56'),
 (5, 2, 59, 83, 63, '56', '85', 66, '61'),
 (5, 2, 47, 66, 63, '56', '85', 66, '61'),
 (5, 2, 45, 62, 63, '56', '85', 66, '61'),
 (5, 2, 50, 67, 63, '56', '85', 66, '61'),
 (5, 2, 65, 90, 63, '56', '85', 66, '61'),
 (5, 3, 59, 83, 66, '58', '86', 71, '66'),
 (5, 3, 48, 66, 66, '58', '86', 71, '66'),
 (5, 3, 45, 62, 66, '58', '86', 71, '66'),
 (5, 3, 50, 67, 66, '58', '86', 71, '66'),
 (5, 3, 66, 91, 66, '58', '86', 71, '66'),
 (5, 4, 49, 68, 67, '54', '75', 66, '71'),
 (5, 4, 45, 62, 67, '54', '75', 66, '71'),
 (5, 4, 59, 83, 67, '54', '75', 66, '71')]

In [ ]:
# added the where clause of: avg2023.Day != '05'
# because that was our deleted station logged information